In [15]:
import numpy as np 
import pandas as pd

In [3]:
s1 = pd.Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
s1.values

array([1, 2, 3, 4])

In [7]:
s2 = pd.Series([1,2,3,4], index=list("abcd"))
s2

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
s2[0]

C:\Users\Admin\AppData\Local\Temp\ipykernel_20000\2344841457.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[0]

np.int64(1)

In [10]:
s2['a']

np.int64(1)

In [11]:
df1 = pd.DataFrame({'name':['Long','Mai'],
                    'Scores':[9,7]})
df1

   name  Scores
0  Long       9
1   Mai       7

In [12]:
type(df1)

pandas.core.frame.DataFrame

In [13]:
type(s1)

pandas.core.series.Series

In [16]:
df2 = pd.DataFrame(data=np.arange(1,7).reshape(2,3), 
                   index=['row1','row2'],
                   columns=['col1','col2','col3'])
df2

      col1  col2  col3
row1     1     2     3
row2     4     5     6

In [17]:
df2['col1']

row1    1
row2    4
Name: col1, dtype: int64

In [18]:
df2[['col1','col3']]

      col1  col3
row1     1     3
row2     4     6

In [21]:
df2['col1']

row1    1
row2    4
Name: col1, dtype: int64

In [20]:
df2

      col1  col2  col3
row1     1     2     3
row2     4     5     6

In [19]:
df2.iloc[0]

col1    1
col2    2
col3    3
Name: row1, dtype: int64

In [22]:
df2.loc['row2']

col1    4
col2    5
col3    6
Name: row2, dtype: int64

In [23]:
df_rt = pd.read_excel(r'Data\Online_Retail.xlsx')
df_rt.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [25]:
df_rt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [28]:
df_rt['InvoiceNo'].value_counts()

InvoiceNo
573585     1114
581219      749
581492      731
580729      721
558475      705
           ...
581483        1
581566        1
C581499       1
C536383       1
C536379       1
Name: count, Length: 25900, dtype: int64

In [29]:
df_rt.shape

(541909, 8)

In [30]:
df_rt.describe()

,Quantity,InvoiceDate,UnitPrice,CustomerID
count,541909.000000,541909,541909.000000,406829.000000
mean,9.552250,2011-07-04 13:34:57.156386048,4.611114,15287.690570
min,-80995.000000,2010-12-01 08:26:00,-11062.060000,12346.000000
25%,1.000000,2011-03-28 11:34:00,1.250000,13953.000000
50%,3.000000,2011-07-19 17:17:00,2.080000,15152.000000
75%,10.000000,2011-10-19 11:27:00,4.130000,16791.000000
max,80995.000000,2011-12-09 12:50:00,38970.000000,18287.000000
std,218.081158,NaN,96.759853,1713.600303

In [31]:
data = {'Tên': ['An', 'Bình', 'Chi', 'Dũng'],
         'Tuổi': [28, 34, 29, 42],
         'Thành phố': ['Hà Nội', 'TP.HCM', 'Đà Nẵng', 'Hà Nội']}
df_sample = pd.DataFrame(data)
df_sample

    Tên  Tuổi Thành phố
0    An    28    Hà Nội
1  Bình    34    TP.HCM
2   Chi    29   Đà Nẵng
3  Dũng    42    Hà Nội

In [32]:
df_sample['Tên']

0      An
1    Bình
2     Chi
3    Dũng
Name: Tên, dtype: object

In [33]:
df_sample[['Tên','Thành phố']]

    Tên Thành phố
0    An    Hà Nội
1  Bình    TP.HCM
2   Chi   Đà Nẵng
3  Dũng    Hà Nội

In [34]:
df_sample

    Tên  Tuổi Thành phố
0    An    28    Hà Nội
1  Bình    34    TP.HCM
2   Chi    29   Đà Nẵng
3  Dũng    42    Hà Nội

In [38]:
df_sample[df_sample['Tuổi']>30]

    Tên  Tuổi Thành phố
1  Bình    34    TP.HCM
3  Dũng    42    Hà Nội

In [40]:
data_missing = {'Sản phẩm': ['A', 'B', 'C', 'D'],
                 'Giá': [100, 200, np.nan, 400],
                 'Tồn kho': [10, np.nan, 30, 50]}
df_missing = pd.DataFrame(data_missing)
df_missing

  Sản phẩm    Giá  Tồn kho
0        A  100.0     10.0
1        B  200.0      NaN
2        C    NaN     30.0
3        D  400.0     50.0

In [42]:
df_missing.isna()

   Sản phẩm    Giá  Tồn kho
0     False  False    False
1     False  False     True
2     False   True    False
3     False  False    False

In [ ]:
df_missing.isnull().sum()

Sản phẩm    0
Giá         1
Tồn kho     1
dtype: int64

In [50]:
df_missing['Giá']

0    100.0
1    200.0
2      NaN
3    400.0
Name: Giá, dtype: float64

In [51]:
gia_mean = df_missing['Giá'].mean()
df_missing['Giá'].fillna(gia_mean)

0    100.000000
1    200.000000
2    233.333333
3    400.000000
Name: Giá, dtype: float64

In [52]:
df_missing

  Sản phẩm    Giá  Tồn kho
0        A  100.0     10.0
1        B  200.0      NaN
2        C    NaN     30.0
3        D  400.0     50.0

In [ ]:
df_missing.dropna()

  Sản phẩm    Giá  Tồn kho
0        A  100.0     10.0
3        D  400.0     50.0

In [ ]:
df_missing.dropna(subset='Giá') # thường dùng hơn, tập trung vào đối tượng cần phân tích

  Sản phẩm    Giá  Tồn kho
0        A  100.0     10.0
1        B  200.0      NaN
3        D  400.0     50.0

In [55]:
data_types = {'Mã KH': [101, 102, 103],
               'Doanh thu': ['5,000', '12,000', '7,500']}
df_types = pd.DataFrame(data_types)
df_types

   Mã KH Doanh thu
0    101     5,000
1    102    12,000
2    103     7,500

In [56]:
df_types.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Mã KH      3 non-null      int64
 1   Doanh thu  3 non-null      object
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [58]:
df_types['Mã KH'] = df_types['Mã KH'].astype(str)
df_types.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Mã KH      3 non-null      object
 1   Doanh thu  3 non-null      object
dtypes: object(2)
memory usage: 180.0+ bytes

In [60]:
df_types['Doanh thu'] = df_types['Doanh thu'].str.replace(',','').astype(float)
df_types

  Mã KH  Doanh thu
0   101     5000.0
1   102    12000.0
2   103     7500.0

In [61]:
df_sample

    Tên  Tuổi Thành phố
0    An    28    Hà Nội
1  Bình    34    TP.HCM
2   Chi    29   Đà Nẵng
3  Dũng    42    Hà Nội

In [63]:
df_sample['Thành phố'].value_counts()

Thành phố
Hà Nội     2
TP.HCM     1
Đà Nẵng    1
Name: count, dtype: int64

In [65]:
df = pd.DataFrame({'key': list("ABCABC"),
                   "data":range(6)},
                   columns=['key','data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [70]:
df['key'].value_counts()

key
A    2
B    2
C    2
Name: count, dtype: int64

In [67]:
list(df.groupby('key'))

[('A',
    key  data
  0   A     0
  3   A     3),
 ('B',
    key  data
  1   B     1
  4   B     4),
 ('C',
    key  data
  2   C     2
  5   C     5)]

In [71]:
data_group = {'Phòng ban': ['Sale', 'IT', 'Sale', 'IT', 'HR'],
               'Lương': [500, 700, 600, 800, 400]}
df_group = pd.DataFrame(data_group)
df_group

  Phòng ban  Lương
0      Sale    500
1        IT    700
2      Sale    600
3        IT    800
4        HR    400

In [72]:
df_group.groupby('Phòng ban').sum()

           Lương
Phòng ban
HR           400
IT          1500
Sale        1100

In [73]:
df_group.groupby('Phòng ban').aggregate(['sum','min',lambda x: x.mean()])

          Lương
            sum  min <lambda_0>
Phòng ban
HR          400  400      400.0
IT         1500  700      750.0
Sale       1100  500      550.0